{
  "template_id": "POL002",
  "template_name": "Equality & Diversity Policy",
  "category": "Policy",
  "jurisdiction": "England & Wales",
  "last_updated": "2025-01-01",
  "compliance_year": 2025,
  "legal_citations": ["Equality Act 2010", "Human Rights Act 1998"],
  "metadata": {"version": "1.0", "language": "en-GB"},
  "content": {
    "title": "EQUALITY AND DIVERSITY POLICY",
    "sections": ["1. COMMITMENT: [COMPANY_NAME] is committed to equality, diversity, and inclusion. We value diversity and treat everyone with dignity and respect.", "2. PROTECTED CHARACTERISTICS (Equality Act 2010):\n- Age\n- Disability\n- Gender reassignment\n- Marriage and civil partnership\n- Pregnancy and maternity\n- Race (including nationality, ethnic origin)\n- Religion or belief\n- Sex\n- Sexual orientation", "3. SCOPE: This policy applies to:\n- Recruitment and selection\n- Terms and conditions\n- Pay and benefits\n- Training and development\n- Promotion and career progression\n- Discipline and grievance\n- Termination\n- Relationships with customers, suppliers, visitors", "4. PROHIBITED CONDUCT:\n\n**Direct discrimination:** Treating someone less favourably because of a protected characteristic.\n\n**Indirect discrimination:** Applying a provision, criterion, or practice that disadvantages a particular group (unless objectively justified).\n\n**Harassment:** Unwanted conduct related to a protected characteristic that violates dignity or creates intimidating, hostile, degrading, humiliating, or offensive environment.\n\n**Victimisation:** Treating someone badly because they complained about discrimination or supported someone else's complaint.\n\n**Discrimination by association:** Treating someone less favourably because of their association with someone with a protected characteristic.\n\n**Discrimination by perception:** Treating someone less favourably because of incorrect perception they have a protected characteristic.", "5. POSITIVE ACTION: We may take lawful positive action to address under-representation (e.g., encouraging applications from under-represented groups, targeted training). This is not positive discrimination.", "6. REASONABLE ADJUSTMENTS: We will make reasonable adjustments for disabled employees and applicants to ensure they are not disadvantaged.", "7. EQUAL PAY: We pay equal pay for equal work regardless of sex. We conduct pay gap analysis and publish gender pay gap data (if 250+ employees).", "8. RECRUITMENT: We recruit on merit. Job descriptions and person specifications are objective. Unconscious bias training for hiring managers. Diverse interview panels where possible.", "9. TRAINING: All employees receive equality and diversity training. Managers receive additional training on their responsibilities.", "10. MONITORING: We monitor diversity data (voluntary and confidential) to assess policy effectiveness and identify areas for improvement.", "11. COMPLAINTS: Discrimination, harassment, or victimisation should be reported via the Grievance Procedure. We will investigate and take appropriate action. Confidentiality maintained. No victimisation for raising concerns.", "12. BREACHES: Breaches are serious and may result in disciplinary action up to dismissal.", "13. RESPONSIBILITIES:\n- Board: Strategic commitment to equality\n- Managers: Implement policy, set example, address issues\n- All employees: Comply with policy, treat others with respect, challenge discrimination"],
    "gender_pay_gap_2025": "Employers with 250+ employees must publish annual gender pay gap data by 4 April (private sector) or 30 March (public sector):\n- Mean and median gender pay gap\n- Mean and median bonus gap\n- Proportion receiving bonuses\n- Quartile pay bands"
  },
  "placeholders": ["COMPANY_NAME"],
  "compliance_checklist": ["Equality Act 2010 compliance", "All 9 protected characteristics covered", "Direct and indirect discrimination prohibited", "Harassment and victimisation addressed", "Reasonable adjustments commitment", "Equal pay commitment", "Positive action approach", "Reporting mechanism", "Training provision", "Monitoring arrangements", "Gender pay gap reporting (if 250+)", "Regular review"]
}
